In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
# loading data set
df = pd.read_csv('patient_Data.csv')
df

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [15]:
# info of the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [16]:
# selecting column
sel_col = df[['PatientID','Department','Doctor','BillAmount']]
sel_col

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [17]:
# Dropping colums
df = df.drop(columns=['ReceptionistID', 'CheckInTime'])
df

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [18]:
# Group by Department and calculate total bill amount
total_bill_per_dept = df.groupby('Department')['BillAmount'].sum()

print(total_bill_per_dept)

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [26]:
# dropping duplicated based on PatientID
df.drop_duplicates('PatientID',inplace=True)
df

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [33]:
# Fill missing values
df['BillAmount'] = df['BillAmount'].fillna(df['BillAmount'].mean())
df

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333

In [34]:
# reading billind dataset
df1=pd.read_csv('Billing_Data.csv')
df1.head(2)

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500

In [41]:
# merging data based on PatientID(ie. patient data with billing data)
merged_df = pd.merge(df1, df, on='PatientID', how='inner')
merged_df

,PatientID,InsuranceCovered,FinalAmount,Name,Department,Doctor,BillAmount
0,101,2000,3000,Alice,Cardiology,Dr. Smith,5000.000000
1,102,1500,3500,Bob,Neurology,Dr. John,6233.333333
2,103,2500,5000,Charlie,Orthopedics,Dr. Lee,7500.000000
3,104,3000,3200,David,Cardiology,Dr. Smith,6200.000000
4,105,1000,4000,Eva,Dermatology,Dr. Rose,6233.333333

In [61]:
# Concatenate new patients dataframe row-wise
updated_patient_df = pd.concat([df, df['PatientID']], axis=0, ignore_index=True)

print(updated_patient_df.head())

   PatientID     Name   Department     Doctor   BillAmount   0
0      101.0    Alice   Cardiology  Dr. Smith  5000.000000 NaN
1      102.0      Bob    Neurology   Dr. John  6233.333333 NaN
2      103.0  Charlie  Orthopedics    Dr. Lee  7500.000000 NaN
3      104.0    David   Cardiology  Dr. Smith  6200.000000 NaN
4      105.0      Eva  Dermatology   Dr. Rose  6233.333333 NaN

In [62]:
# Concatenate new billing columns column-wise
updated_billing_df = pd.concat([df1,df['BillAmount']], axis=1)

print(updated_billing_df.head())

   PatientID  InsuranceCovered  FinalAmount   BillAmount
0        101              2000         3000  5000.000000
1        102              1500         3500  6233.333333
2        103              2500         5000  7500.000000
3        104              3000         3200  6200.000000
4        105              1000         4000  6233.333333